In [116]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from word2number import w2n

In [117]:
df = pd.read_csv("hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [118]:
df.experience=df.experience.fillna("zero")

In [119]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [131]:
df.experience=df["experience"].apply(w2n.word_to_num)

In [132]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [133]:
import math
mean_test_score = math.floor(df['test_score(out of 10)'].mean())
df['test_score(out of 10)']= df['test_score(out of 10)'].fillna(mean_test_score)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [134]:
reg = linear_model.LinearRegression()

In [136]:
reg.fit(df.loc[:,:'interview_score(out of 10)'],df['salary($)'])

LinearRegression()

In [137]:
reg.predict([[2,9,6]])

array([53713.86677124])

In [141]:
xp = [2,3,4]
ts = [9,10,5]
isc= [6,7,8]
df1=pd.DataFrame()
df1['xp']=xp
df1['ts']=ts
df1['isc']=isc
df1

   xp  ts  isc
0   2   9    6
1   3  10    7
2   4   5    8

In [142]:
reg.predict(df1)

array([53713.86677124, 61004.92745222, 54968.13353566])